#### Terraform Plan 📖 ####
<details><summary>Show Plan</summary>

```terraform
tailscale_tailnet_key.main: Refreshing state... [id=kANHoGieHD11CNTRL]
data.oci_containerengine_cluster_option.main: Reading...
oci_identity_group.managers: Refreshing state... [id=ocid1.group.oc1..aaaaaaaac7alsg5sta36d66mr4yflfdakygdxxusvnv54km3nznudlyvbaba]
data.oci_identity_availability_domains.main: Reading...
data.oci_core_services.all_services: Reading...
oci_identity_compartment.platform: Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaaxks7l2gcjjk3euzod7mzd22vc6bmczuqtto3f6z3aamcglgy2ujq]
oci_objectstorage_bucket.state: Refreshing state... [id=n/cnm7patunz1z/b/platform-state]
oci_identity_user.manager: Refreshing state... [id=ocid1.user.oc1..aaaaaaaafxpfydig3om5bsydxijntrc64fbbjalgrjybqq6i2eihpjkxpzta]
data.oci_identity_availability_domains.main: Read complete after 1s [id=IdentityAvailabilityDomainsDataSource-686890930]
data.oci_identity_fault_domains.main: Reading...
oci_core_vcn.main: Refreshing state... [id=ocid1.vcn.oc1.ap-seoul-1.amaaaaaabsyhd7qazvdwifpfgn75iw5yxheajr5ng4esmlikj23v7ee2ef3q]
oci_identity_policy.cluster: Refreshing state... [id=ocid1.policy.oc1..aaaaaaaagu6nbrnawfhjdwnrkfbzn6smo345m22gzfl55qxvxt7vep4yfqeq]
oci_core_public_ip.main: Refreshing state... [id=ocid1.publicip.oc1.ap-seoul-1.amaaaaaabsyhd7qafbingjhb7nxqn3qcaowsc7sgyi2trscfa6jzlhu7wvmq]
data.oci_containerengine_cluster_option.main: Read complete after 1s [id=ContainerengineClusterOptionDataSource-1870923232]
data.oci_core_images.ubuntu: Reading...
data.oci_core_services.all_services: Read complete after 1s [id=CoreServicesDataSource-0]
oci_identity_policy.manager: Refreshing state... [id=ocid1.policy.oc1..aaaaaaaayhc5xs4li2w3l32btbgwn5bh6om3lyn2y2qiyvcrsebvbno4e6cq]
oci_identity_user_group_membership.manager: Refreshing state... [id=ocid1.groupmembership.oc1..aaaaaaaa3mgwk4qef6qpqqgvi7duo7ep6ydxa6ionu4l5gx3vgffqaa3qutq]
data.oci_identity_fault_domains.main: Read complete after 0s [id=IdentityFaultDomainsDataSource-2954258040]
oci_core_network_security_group.bastion-to-global: Refreshing state... [id=ocid1.networksecuritygroup.oc1.ap-seoul-1.aaaaaaaayquhop5uavha3rpzt4lukx6kdpz6d6wraegzddtzahq4pnlwhzgq]
oci_core_internet_gateway.main: Refreshing state... [id=ocid1.internetgateway.oc1.ap-seoul-1.aaaaaaaaonpjrtiqcayeevrkbiavrrjberaljszeqx3xxucgnczyyn34u4ka]
oci_core_nat_gateway.main: Refreshing state... [id=ocid1.natgateway.oc1.ap-seoul-1.aaaaaaaap7fljb33jz7xfhnm54leup5owryl6xen4fzgkvnjqdz3dtsoupkq]
oci_core_service_gateway.main: Refreshing state... [id=ocid1.servicegateway.oc1.ap-seoul-1.aaaaaaaa6pdgo7kccqt4r4cs747knrxybmaz2xkcvdaqau6ztjc2rdm3tnba]
data.oci_core_images.ubuntu: Read complete after 1s [id=CoreImagesDataSource-675692870]
oci_core_network_security_group_security_rule.bastion-to-global: Refreshing state... [id=5B12E3]
oci_core_route_table.public: Refreshing state... [id=ocid1.routetable.oc1.ap-seoul-1.aaaaaaaaf4htalzhwrxx4763yptthhd7oxu4schmuv2hq5u32xbi22pygdqq]
oci_core_subnet.public: Refreshing state... [id=ocid1.subnet.oc1.ap-seoul-1.aaaaaaaavvobrlojwajixsampnnqwjpnrwqrp23kp5kfnr3vxqxdluskhafq]
oci_load_balancer_load_balancer.main: Refreshing state... [id=ocid1.loadbalancer.oc1.ap-seoul-1.aaaaaaaatssba24t3l4kozqymaqhubbtif6sx65rdw4begr7nxwedmep46ga]
oci_core_route_table.private: Refreshing state... [id=ocid1.routetable.oc1.ap-seoul-1.aaaaaaaa2gdnpvg6ecx744a63vowlzaagbsqkmbb7wuf2i5lyyilfaesfpmq]
oci_core_subnet.private: Refreshing state... [id=ocid1.subnet.oc1.ap-seoul-1.aaaaaaaaz2zzw7w2kolrxzxelyfpu2lnsa6oths6txnblyewgc7wf3pr6dqq]
tailscale_acl.main: Refreshing state... [id=1b5d5621-19fb-f490-b890-5cba657914cf]
oci_core_instance.bastion: Refreshing state... [id=ocid1.instance.oc1.ap-seoul-1.anuwgljrbsyhd7qcrxmlulolu4tzvap7fgqnkmyhieqcmmbeo6eqktuawniq]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.oci_containerengine_node_pool_option.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "oci_containerengine_node_pool_option" "main" {
      + compartment_id        = "ocid1.tenancy.oc1..aaaaaaaa5vwe52hngn55vyyitt2xeigrjqsibrlmewnsv2wjo3hnaw55i3aa"
      + id                    = (known after apply)
      + images                = (known after apply)
      + kubernetes_versions   = (known after apply)
      + node_pool_k8s_version = "v1.34.1"
      + node_pool_option_id   = "all"
      + node_pool_os_arch     = "AARCH64"
      + shapes                = (known after apply)
      + sources               = (known after apply)
    }

  # oci_containerengine_cluster.main will be created
  + resource "oci_containerengine_cluster" "main" {
      + available_kubernetes_upgrades      = (known after apply)
      + compartment_id                     = "ocid1.compartment.oc1..aaaaaaaaxks7l2gcjjk3euzod7mzd22vc6bmczuqtto3f6z3aamcglgy2ujq"
      + defined_tags                       = (known after apply)
      + endpoints                          = (known after apply)
      + freeform_tags                      = (known after apply)
      + id                                 = (known after apply)
      + kms_key_id                         = (known after apply)
      + kubernetes_version                 = "v1.34.1"
      + lifecycle_details                  = (known after apply)
      + metadata                           = (known after apply)
      + name                               = "platform-cluster-main"
      + open_id_connect_discovery_endpoint = (known after apply)
      + open_id_connect_discovery_key      = (known after apply)
      + state                              = (known after apply)
      + type                               = (known after apply)
      + vcn_id                             = "ocid1.vcn.oc1.ap-seoul-1.amaaaaaabsyhd7qazvdwifpfgn75iw5yxheajr5ng4esmlikj23v7ee2ef3q"

      + cluster_pod_network_options (known after apply)

      + endpoint_config {
          + is_public_ip_enabled = (known after apply)
          + subnet_id            = "ocid1.subnet.oc1.ap-seoul-1.aaaaaaaaz2zzw7w2kolrxzxelyfpu2lnsa6oths6txnblyewgc7wf3pr6dqq"
        }

      + image_policy_config (known after apply)

      + options (known after apply)
    }

  # oci_containerengine_node_pool.main will be created
  + resource "oci_containerengine_node_pool" "main" {
      + cluster_id          = (known after apply)
      + compartment_id      = "ocid1.compartment.oc1..aaaaaaaaxks7l2gcjjk3euzod7mzd22vc6bmczuqtto3f6z3aamcglgy2ujq"
      + defined_tags        = (known after apply)
      + freeform_tags       = (known after apply)
      + id                  = (known after apply)
      + kubernetes_version  = "v1.34.1"
      + lifecycle_details   = (known after apply)
      + name                = "platform-node-pool-main"
      + node_image_id       = (known after apply)
      + node_image_name     = (known after apply)
      + node_metadata       = (known after apply)
      + node_shape          = "VM.Standard.A1.Flex"
      + node_source         = (known after apply)
      + nodes               = (known after apply)
      + quantity_per_subnet = (known after apply)
      + ssh_public_key      = (known after apply)
      + state               = (known after apply)
      + subnet_ids          = (known after apply)

      + initial_node_labels (known after apply)

      + node_config_details {
          + defined_tags                        = (known after apply)
          + freeform_tags                       = (known after apply)
          + is_pv_encryption_in_transit_enabled = (known after apply)
          + kms_key_id                          = (known after apply)
          + nsg_ids                             = (known after apply)
          + size                                = 2

          + node_pool_pod_network_option_details (known after apply)

          + placement_configs {
              + availability_domain     = "rtRb:AP-SEOUL-1-AD-1"
              + capacity_reservation_id = (known after apply)
              + fault_domains           = [
                  + "FAULT-DOMAIN-1",
                  + "FAULT-DOMAIN-2",
                  + "FAULT-DOMAIN-3",
                ]
              + subnet_id               = "ocid1.subnet.oc1.ap-seoul-1.aaaaaaaaz2zzw7w2kolrxzxelyfpu2lnsa6oths6txnblyewgc7wf3pr6dqq"

              + preemptible_node_config (known after apply)
            }
        }

      + node_eviction_node_pool_settings (known after apply)

      + node_pool_cycling_details (known after apply)

      + node_shape_config {
          + memory_in_gbs = 12
          + ocpus         = 2
        }

      + node_source_details {
          + boot_volume_size_in_gbs = (known after apply)
          + image_id                = (known after apply)
          + source_type             = "IMAGE"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @ensia96, Action: `pull_request`*